socialNetwork/runs/e2e-read-user-timelines-2-QRtp/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 19.536ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 19.404ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 20.592ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 19.511ms, rate sampling interval: 59ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.36ms    7.84ms  46.91ms   77.34%
    Req/Sec   252.12     64.79   419.00     70.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.60ms
 75.000%   22.42ms
 90.000%   29.49ms
 99.000%   46.91ms
 99.900%   62.56ms
 99.990%   84.35ms
 99.999%   90.05ms
100.000%   90.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.251     0.000000            1         1.00
      11.639     0.100000         2003         1.11
      13.183     0.200000         4005         1.25
      14.623     0.300000         6010         1.43
      16.063     0.400000         8006         1.67
      17.599     0.500000        10008         2.00
      18.431     0.550000        11022         2.22
      19.231     0.600000        12024         2.50
      20.175     0.650000        13031         2.86
      21.135     0.700000        14014         3.33
      22.415     0.750000        15013         4.00
      23.183     0.775000        15520         4.44
      24.079     0.800000        16013         5.00
      25.151     0.825000        16515         5.71
      26.367     0.850000        17016         6.67
      27.807     0.875000        17515         8.00
      28.655     0.887500        17768         8.89
      29.487     0.900000        18015        10.00
      30.527     0.912500        18265        11.43
      31.663     0.925000        18518        13.33
      33.087     0.937500        18767        16.00
      33.823     0.943750        18895        17.78
      34.751     0.950000        19015        20.00
      35.679     0.956250        19141        22.86
      36.863     0.962500        19267        26.67
      38.207     0.968750        19394        32.00
      38.975     0.971875        19454        35.56
      39.839     0.975000        19516        40.00
      41.119     0.978125        19579        45.71
      42.239     0.981250        19640        53.33
      43.583     0.984375        19704        64.00
      44.415     0.985938        19734        71.11
      45.375     0.987500        19766        80.00
      46.079     0.989062        19798        91.43
      47.423     0.990625        19829       106.67
      48.639     0.992188        19859       128.00
      49.791     0.992969        19875       142.22
      50.623     0.993750        19890       160.00
      51.583     0.994531        19906       182.86
      52.735     0.995313        19922       213.33
      53.823     0.996094        19937       256.00
      54.367     0.996484        19945       284.44
      56.095     0.996875        19953       320.00
      56.607     0.997266        19961       365.71
      57.663     0.997656        19969       426.67
      58.591     0.998047        19976       512.00
      59.039     0.998242        19980       568.89
      59.551     0.998437        19984       640.00
      60.735     0.998633        19988       731.43
      61.247     0.998828        19992       853.33
      62.719     0.999023        19996      1024.00
      63.839     0.999121        19998      1137.78
      65.535     0.999219        20000      1280.00
      65.919     0.999316        20002      1462.86
      67.519     0.999414        20004      1706.67
      68.159     0.999512        20006      2048.00
      71.103     0.999561        20007      2275.56
      71.359     0.999609        20008      2560.00
      72.127     0.999658        20009      2925.71
      73.663     0.999707        20010      3413.33
      81.727     0.999756        20011      4096.00
      81.727     0.999780        20011      4551.11
      82.431     0.999805        20012      5120.00
      82.431     0.999829        20012      5851.43
      84.351     0.999854        20013      6826.67
      84.351     0.999878        20013      8192.00
      84.351     0.999890        20013      9102.22
      84.799     0.999902        20014     10240.00
      84.799     0.999915        20014     11702.86
      84.799     0.999927        20014     13653.33
      84.799     0.999939        20014     16384.00
      84.799     0.999945        20014     18204.44
      90.047     0.999951        20015     20480.00
      90.047     1.000000        20015          inf
#[Mean    =       19.356, StdDeviation   =        7.845]
#[Max     =       89.984, Total count    =        20015]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29927 requests in 30.00s, 413.93MB read
Requests/sec:    997.59  
Transfer/sec:     13.80MB